lab11db/app/controllers/palin_controller.rb

  def outputdb
  	@num = params[:arr]

	if /[0-9]+/.match(@num).nil?
		@result = "ОШИБКА. Введено не число"
	else
	  	if palsmth = Palindrom.find_by_num(@num)
	  		@result = ActiveSupport::JSON::decode(palsmth.palind)
	  	else
	  		@result = (0..@num.to_i).select { |x| (x.to_s.reverse == x.to_s) && ((x**2).to_s.reverse == (x**2).to_s) }
	  		arr = @result.map {|x| x**2}
	  		palsmth = Palindrom.create :num => @num, :palind => ActiveSupport::JSON::encode( @result ), \
	  		:sq => ActiveSupport::JSON::encode( arr )
---
SELECT  "palindroms".* FROM "palindroms" WHERE "palindroms"."num" = ? LIMIT ?  [["num", 343], ["LIMIT", 1]]
INSERT INTO "palindroms" ("num", "palind", "sq", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  	def results
  		@result = Palindrom.all
---
SELECT "palindroms".* FROM "palindroms"